{
  "experiences": [
    {
      "id": "ghent-cbbds-researcher-2022-10",
      "slug": "researcher-center-for-biosystems-and-biotech-data-science-ghent-university",
      "organization": "Center for Biosystems and Biotech Data Science, Ghent University",
      "role": "Researcher",
      "location": "Ghent, Belgium",
      "start_date": "2022-10",
      "end_date": "2023-05",
      "supervisor": "Prof. Dr. Joris Vankerschaver",
      "description": "Conducted research at the intersection of computational biology and medical AI, focusing on DNA sequence modeling and surgical video understanding with deep learning.",
      "bullets": [
        "Devised a DNA data augmentation method by mimicking silent mutation processes.",
        "Predicted DNA-to-protein translation initiation likelihood with a CNN model.",
        "Built a pre-trained CNN model for surgical datasets with self-supervised learning."
      ],
      "achievements": [
        "Delivered a reproducible pipeline for DNA augmentation usable across related projects.",
        "Established a baseline CNN for translation initiation prediction to support downstream analyses.",
        "Prepared pre-trained surgical-vision features to accelerate labeling and model development."
      ],
      "technologies": ["Python", "PyTorch", "scikit-learn", "OpenCV", "Biopython", "Git", "Linux"],
      "team_size": 5
    },
    {
      "id": "ghent-cbbds-intern-2021-07",
      "slug": "intern-center-for-biosystems-and-biotech-data-science-ghent-university-2021-summer",
      "organization": "Center for Biosystems and Biotech Data Science, Ghent University",
      "role": "Intern",
      "location": "Ghent, Belgium",
      "start_date": "2021-07",
      "end_date": "2021-08",
      "supervisor": "Prof. Dr. Wesley De Neve",
      "description": "Summer internship focused on object detection for medical images and surgical video analytics.",
      "bullets": [
        "Conducted research on object detection for medical image and video analysis.",
        "Developed an object detection algorithm for surgical video analysis."
      ],
      "achievements": [
        "Implemented a working detection prototype applicable to laparoscopic scenarios.",
        "Documented dataset preparation and evaluation protocols for reuse."
      ],
      "technologies": ["Python", "PyTorch", "OpenCV"],
      "team_size": 4
    },
    {
      "id": "ghent-brc-intern-2021-08",
      "slug": "intern-biomedical-research-center-ghent-university-2021-august",
      "organization": "Biomedical Research Center, Ghent University",
      "role": "Intern",
      "location": "Ghent, Belgium",
      "start_date": "2021-08",
      "end_date": "2021-08",
      "supervisor": "Prof. Dr. Magdalena Radwanska",
      "description": "Explored parasitic infection effects using single-cell RNA-seq analysis and dimensionality reduction workflows.",
      "bullets": [
        "Experimented on the effects of parasite infection with UMAP-based visualization.",
        "Analyzed raw single-cell RNA-seq data using bioinformatics tools (e.g., R) to discover cell populations present during a disease stage."
      ],
      "achievements": [
        "Produced annotated cell-cluster visualizations supporting hypothesis generation.",
        "Standardized a minimal scRNA-seq preprocessing script for lab members."
      ],
      "technologies": ["R", "Seurat", "UMAP", "ggplot2"],
      "team_size": 3
    },
    {
      "id": "ghent-cbbds-intern-2021-02",
      "slug": "intern-center-for-biosystems-and-biotech-data-science-ghent-university-2021-spring",
      "organization": "Center for Biosystems and Biotech Data Science, Ghent University",
      "role": "Intern",
      "location": "Ghent, Belgium",
      "start_date": "2021-02",
      "end_date": "2021-03",
      "supervisor": "Prof. Dr. Utku Ozbulak",
      "description": "Applied deep learning to DNA sequence modeling; investigated model sensitivity to point mutations.",
      "bullets": [
        "Applied deep learning models for prediction and evaluation.",
        "Executed point mutations in DNA and analyzed their effect on deep neural network predictions, focusing on translation initiation site prediction."
      ],
      "achievements": [
        "Established a mutation-testing protocol to measure model robustness on genomic inputs.",
        "Shared reproducible notebooks for mutation impact analysis with the group."
      ],
      "technologies": ["Python", "PyTorch", "NumPy", "Biopython", "Matplotlib"],
      "team_size": 4
    }
  ]
}
